controllers/MahasiswaController.php

    protected function findModel($id)
    {
        if (($model = Mahasiswa::findOne($id)) !== null) {
---
SELECT * FROM `mahasiswa` WHERE `id`='38'