models/Fakultas.php

    public static function getFakultas()
    {
        return Self::find()->select(['nama_fakultas', 'id_fakultas'])->indexBy('id_fakultas')->column();
---
SELECT `nama_fakultas`, `id_fakultas` FROM `fakultas`