models/Prodi.php

    public static function getProdiList($fakultasID, $dependent = false)
    {
        // $subCategory = self::find()
        // ->select(['prodi as name', 'id'])
        // ->where(['id_fakultas' => $fakultasID])
        // ->asArray()
        // ->all();

        // return $subCategory;

        $subCategory = self::find()->where(['id_fakultas'=>$fakultasID]);
        if ($dependent=="") {
            return $subCategory->select(['id','prodi as name'])->asArray()->all();
---
SELECT `id`, `prodi` AS `name` FROM `prodi` WHERE `id_fakultas` IS NULL