models/Provinces.php

SELECT `name`, `id` FROM `provinces`
---
    public static function getProv()
    {
        return Self::find()->select(['name', 'id'])->indexBy('id')->column();