models/Regencies.php

    public static function getKab($provincesID, $dependent = false)
    {
        // $subCategory = self::find()
        // ->select(['prodi as name', 'id'])
        // ->where(['id_fakultas' => $fakultasID])
        // ->asArray()
        // ->all();

        // return $subCategory;
        #var_dump($provincesID);
        $subCategory = self::find()->where(['province_id'=>$provincesID]);
        if ($dependent=="") {
            #$jancuk = $subCategory->select(['id','name as name'])->asArray()->all()
            #var_dump($subCategory->select(['id','name as name'])->asArray()->all());
            return $subCategory->select(['id','name as name'])->asArray()->all();
---
SELECT `id`, `name` FROM `regencies` WHERE `province_id` IS NULL